lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/ble_channel_sounding.h
#pragma once

#include <stddef.h>
#include <stdint.h>
#include <string.h>

#include "nrf54l15_hal.h"
#include "nrf54l15_vpr.h"

class Stream;

namespace xiao_nrf54l15 {

constexpr size_t kBleCsMaxSwitchPatternCount = 8U;
constexpr size_t kBleCsChannelMapBytes = 10U;
constexpr uint8_t kBleCsMainMode1 = 0x1U;
constexpr uint8_t kBleCsMainMode2 = 0x2U;
constexpr uint8_t kBleCsMainMode3 = 0x3U;
constexpr uint8_t kBleCsToneQualityHigh = 0x0U;
constexpr uint8_t kBleCsToneQualityMedium = 0x1U;
constexpr uint8_t kBleCsToneQualityLow = 0x2U;
constexpr uint8_t kBleCsToneQualityUnavailable = 0x3U;
constexpr uint8_t kBleCsToneExtensionNone = 0x0U;
constexpr uint8_t kBleCsToneExtensionUnexpected = 0x1U;
constexpr uint8_t kBleCsToneExtensionExpected = 0x2U;
constexpr uint8_t kBleCsPacketQualityAaCheckOk = 0x0U;
constexpr uint8_t kBleCsPacketQualityAaCheckBitErrors = 0x1U;
constexpr uint8_t kBleCsPacketQualityAaCheckNotFound = 0x2U;
constexpr uint8_t kBleCsPacketRssiNotAvailable = 0x7FU;
constexpr int16_t kBleCsTimeDifferenceNotAvailable =
    static_cast<int16_t>(0x8000);
constexpr uint8_t kBleCsProcedureDoneComplete = 0x0U;
constexpr uint8_t kBleCsProcedureDonePartial = 0x1U;
constexpr uint8_t kBleCsProcedureDoneAborted = 0xFU;
constexpr uint8_t kBleCsSubeventDoneComplete = 0x0U;
constexpr uint8_t kBleCsSubeventDonePartial = 0x1U;
constexpr uint8_t kBleCsSubeventDoneAborted = 0xFU;
constexpr uint16_t kBleCsHciOpReadRemoteSupportedCapabilities = 0x208AU;
constexpr uint16_t kBleCsHciOpWriteCachedRemoteSupportedCapabilities = 0x208BU;
constexpr uint16_t kBleCsHciOpSecurityEnable = 0x208CU;
constexpr uint16_t kBleCsHciOpSetDefaultSettings = 0x208DU;
constexpr uint16_t kBleCsHciOpReadRemoteFaeTable = 0x208EU;
constexpr uint16_t kBleCsHciOpWriteCachedRemoteFaeTable = 0x208FU;
constexpr uint16_t kBleCsHciOpCreateConfig = 0x2090U;
constexpr uint16_t kBleCsHciOpRemoveConfig = 0x2091U;
constexpr uint16_t kBleCsHciOpSetChannelClassification = 0x2092U;
constexpr uint16_t kBleCsHciOpSetProcedureParameters = 0x2093U;
constexpr uint16_t kBleCsHciOpProcedureEnable = 0x2094U;
constexpr uint16_t kBleCsHciOpTest = 0x2095U;
constexpr uint16_t kBleCsHciOpTestEnd = 0x2096U;
constexpr uint16_t kBleCsHciOpWriteCachedRemoteSupportedCapabilitiesV2 = 0x20A6U;
constexpr uint16_t kBleCsVprHciOpPeerPduInject = 0xFCE8U;
constexpr uint16_t kBleCsVprHciOpPeerStageRead = 0xFCE9U;
constexpr uint16_t kBleCsVprHciOpPendingLocalPduRead = 0xFCEAU;
constexpr uint16_t kBleCsVprHciOpSchedulerRead = 0xFCEBU;
constexpr uint16_t kBleCsVprHciOpMeasurementWorkRead = 0xFCECU;
constexpr uint16_t kBleCsVprHciOpMeasurementExecute = 0xFCEDU;
constexpr uint16_t kBleCsVprHciOpToneSnapshotRead = 0xFCEEU;
constexpr uint8_t kBleCsHciEvtReadRemoteSupportedCapabilitiesComplete = 0x2CU;
constexpr uint8_t kBleCsHciEvtReadRemoteFaeTableComplete = 0x2DU;
constexpr uint8_t kBleCsHciEvtReadRemoteSupportedCapabilitiesCompleteV2 = 0x38U;
constexpr uint8_t kBleCsHciEvtSecurityEnableComplete = 0x2EU;
constexpr uint8_t kBleCsHciEvtConfigComplete = 0x2FU;
constexpr uint8_t kBleCsHciEvtProcedureEnableComplete = 0x30U;
constexpr uint8_t kBleCsHciEvtSubeventResult = 0x31U;
constexpr uint8_t kBleCsHciEvtSubeventResultContinue = 0x32U;
constexpr uint8_t kBleCsHciEvtTestEndComplete = 0x33U;
constexpr uint8_t kBleHciPacketTypeCommand = 0x01U;
constexpr uint8_t kBleHciPacketTypeAcl = 0x02U;
constexpr uint8_t kBleHciPacketTypeSco = 0x03U;
constexpr uint8_t kBleHciPacketTypeEvent = 0x04U;
constexpr uint8_t kBleHciPacketTypeIso = 0x05U;
constexpr uint8_t kBleHciEvtCommandComplete = 0x0EU;
constexpr uint8_t kBleHciEvtCommandStatus = 0x0FU;
constexpr uint8_t kBleHciEvtLeMeta = 0x3EU;
constexpr uint8_t kBleHciEvtVendor = 0xFFU;
constexpr size_t kBleCsMaxControllerStepDataBytes = 1024U;
constexpr size_t kBleCsMaxHciCommandPayloadBytes = 128U;
constexpr size_t kBleCsFaeTableValueCount = 72U;
constexpr size_t kBleCsMaxTestChannelCount = 37U;
constexpr uint16_t kBleCsTestOverrideChannelSelection = (1U << 0U);
constexpr uint16_t kBleCsTestOverrideMainModeSteps = (1U << 2U);
constexpr uint16_t kBleCsTestOverrideToneExtension = (1U << 3U);
constexpr uint16_t kBleCsTestOverrideAntennaPermutation = (1U << 4U);
constexpr uint16_t kBleCsTestOverrideAccessAddresses = (1U << 5U);
constexpr uint16_t kBleCsTestOverrideMarkerPositions = (1U << 6U);
constexpr uint16_t kBleCsTestOverrideMarkerValue = (1U << 7U);
constexpr uint16_t kBleCsTestOverridePayload = (1U << 8U);
constexpr uint16_t kBleCsTestOverrideStablePhase = (1U << 10U);
constexpr uint16_t kBleCsTestSupportedOverrideMask =
    kBleCsTestOverrideChannelSelection |
    kBleCsTestOverrideMainModeSteps |
    kBleCsTestOverrideToneExtension |
    kBleCsTestOverrideAntennaPermutation |
    kBleCsTestOverrideAccessAddresses |
    kBleCsTestOverrideMarkerPositions |
    kBleCsTestOverrideMarkerValue |
    kBleCsTestOverridePayload |
    kBleCsTestOverrideStablePhase;

constexpr uint8_t kBleCsVprPeerStageIdle = 0U;
constexpr uint8_t kBleCsVprPeerStageAwaitingCsRsp = 1U;
constexpr uint8_t kBleCsVprPeerStageAwaitingCsCfg = 2U;
constexpr uint8_t kBleCsVprPeerStageAwaitingProcRsp = 3U;
constexpr uint8_t kBleCsVprPeerStageAwaitingSecRsp = 4U;
constexpr uint8_t kBleCsVprPeerStageAwaitingStart = 5U;
constexpr uint8_t kBleCsVprPeerStageProcedureActive = 6U;

constexpr uint8_t kBleCsLlControlReqRspPduLength = 4U;
constexpr uint8_t kBleCsLlControlReqRspPayloadLength = 2U;
constexpr uint8_t kBleCsLlControlCfgPduLength = 23U;
constexpr uint8_t kBleCsLlControlCfgPayloadLength = 21U;
constexpr uint8_t kBleCsLlControlProcedurePduLength = 21U;
constexpr uint8_t kBleCsLlControlProcedurePayloadLength = 19U;
constexpr uint8_t kBleCsLlControlSecurityPduLength = 3U;
constexpr uint8_t kBleCsLlControlSecurityPayloadLength = 1U;
constexpr uint8_t kBleCsLlControlStartPduLength = 16U;
constexpr uint8_t kBleCsLlControlStartPayloadLength = 14U;
constexpr uint8_t kBleCsLlControlTerminateAbortPduLength = 3U;
constexpr uint8_t kBleCsLlControlTerminateAbortPayloadLength = 1U;
constexpr uint8_t kBleCsLlControlMaxPduLength = 255U;

