lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/ble_channel_sounding.h
struct BleCsStepToneInfo {
  BleCsIqSample pct{};
  uint8_t qualityIndicator = kBleCsToneQualityUnavailable;
  uint8_t extensionIndicator = kBleCsToneExtensionExpected;
};

struct BleCsStepMode2Data {
  uint8_t antennaPermutationIndex = 0U;
  uint8_t toneCount = 0U;
};

struct BleCsStepMode3Data {
  BleCsStepMode1Data timing{};
  uint8_t antennaPermutationIndex = 0U;
  uint8_t toneCount = 0U;
  uint8_t toneDataOffset = 0U;
};

struct BleCsRttSample {
  bool present = false;
  bool valid = false;
  uint8_t aaCheckQuality = 0xFFU;
  uint8_t bitErrors = 0xFFU;
  uint8_t nadm = 0xFFU;
  int8_t packetRssiDbm = 0;
  int16_t timeDifferenceHalfNs = 0;
  uint8_t packetAntenna = 0U;
  uint8_t rawLen = 0U;
  uint8_t rawBytes[8] = {0};
};

struct BleCsChannelMeasurement {
  bool valid = false;
  // 0=ok, 1=invalid setup, 2=control TX, 3=probe TX, 4=report RX,
  // 5=report decode, 6=insufficient tone/RTT quality.
  uint8_t status = 0U;
  uint8_t channelIndex = 0;
  uint8_t sequence = 0;
  uint32_t controlTxUs = 0U;
  uint32_t controlToProbeGapUs = 0U;
  uint32_t probeTxUs = 0U;
  uint32_t reportRxUs = 0U;
  BleCsToneSample localTone;
  BleCsToneSample peerTone;
  BleCsRttSample localRtt;
  BleCsRttSample peerRtt;
  float combinedPhaseRad = 0.0f;
  float rttDistanceMeters = 0.0f;
};

struct BleCsEstimate {
  bool valid = false;
  uint8_t totalToneChannels = 0;
  uint8_t usedChannels = 0;
  uint8_t rttChannels = 0;
  uint8_t rejectedLowQualityChannels = 0;
  uint8_t rejectedResidualChannels = 0;
  float distanceMeters = 0.0f;
  float phaseSlopeDistanceMeters = 0.0f;
  float rttDistanceMeters = 0.0f;
  float slopeRadPerHz = 0.0f;
  float residualVariance = 0.0f;
  float rttVariance = 0.0f;
  float medianToneQuality = 0.0f;
  float fitDeltaMeters = 0.0f;
};

struct BleCsCalibrationProfile {
  float scale = 1.0f;
  float offsetMeters = 0.0f;
  float referenceDistanceMeters = 0.0f;
  float measuredMedianMeters = 0.0f;
  float measuredMadMeters = 0.0f;
  float boardPairBiasMeters = 0.0f;
  float boardPairEquivalentDelayNs = 0.0f;
  float symmetricPerBoardEquivalentDelayNs = 0.0f;
  float validatedMedianMeters = 0.0f;
  float validatedMadMeters = 0.0f;
  float validatedP90AbsErrorMeters = 0.0f;
  uint16_t sampleCount = 0U;
  uint16_t validatedSampleCount = 0U;
};

struct BleCsPhysicalDistanceEstimate {
  bool valid = false;
  float distanceMeters = 0.0f;
  float typicalErrorMeters = 0.0f;
  float conservativeErrorMeters = 0.0f;
  float lowerBoundMeters = 0.0f;
  float upperBoundMeters = 0.0f;
  uint16_t sampleCount = 0U;
};

struct BleCsSubeventResultHeader {
  uint16_t connHandle = 0U;
  uint8_t configId = 0U;
  uint16_t startAclConnEventCounter = 0U;
  uint16_t procedureCounter = 0U;
  uint16_t frequencyCompensation = 0U;
  int8_t referencePowerLevelDbm = 0;
  uint8_t procedureDoneStatus = kBleCsProcedureDoneComplete;
  uint8_t subeventDoneStatus = kBleCsSubeventDoneComplete;
  uint8_t procedureAbortReason = 0U;
  uint8_t subeventAbortReason = 0U;
  uint8_t numAntennaPaths = 0U;
  uint16_t numStepsReported = 0U;
};

struct BleCsSubeventResult {
  BleCsSubeventResultHeader header{};
  const uint8_t* stepData = nullptr;
  uint16_t stepDataLen = 0U;
  bool isPartial = false;
  bool isComplete = false;
  bool isContinuation = false;
};

struct BleCsSubeventResultFragment {
  size_t nextStepDataOffset = 0U;
  uint16_t stepsIncluded = 0U;
  bool more = false;
  bool continuation = false;
};

struct BleCsHciCommand {
  uint16_t opcode = 0U;
  uint8_t payload[kBleCsMaxHciCommandPayloadBytes] = {0};
  uint8_t payloadLen = 0U;
};

struct BleCsHciCommandStatusEvent {
  uint8_t status = 0U;
  uint8_t numCommandPackets = 0U;
  uint16_t opcode = 0U;
};

struct BleCsHciCommandCompleteEvent {
  uint8_t status = 0U;
  uint8_t numCommandPackets = 0U;
  uint16_t opcode = 0U;
  const uint8_t* returnParams = nullptr;
  uint8_t returnParamsLen = 0U;
};

struct BleCsHciLeMetaEvent {
  uint8_t subeventCode = 0U;
  const uint8_t* payload = nullptr;
  uint8_t payloadLen = 0U;
};

struct BleCsVprPeerExchangeState {
  bool valid = false;
  uint8_t status = 0xFFU;
  uint8_t previousStage = kBleCsVprPeerStageIdle;
  uint8_t currentStage = kBleCsVprPeerStageIdle;
  uint32_t deadlineHeartbeat = 0U;
  uint8_t procedureAbortReason = 0U;
  uint8_t subeventAbortReason = 0U;
};

struct BleCsVprSchedulerState {
  bool valid = false;
  uint8_t status = 0xFFU;
  uint8_t flags = 0U;
  bool sessionOpen = false;
  bool procedureEnabled = false;
  bool resultPending = false;
  bool peerProcedureActive = false;
  bool builtInPeerDemoEnabled = false;
  bool testActive = false;
  uint8_t pendingResultStage = 0U;
  uint8_t activeSubeventIndex = 0U;
  uint8_t totalSubevents = 0U;
  uint8_t totalSteps = 0U;
  uint8_t subeventStartStep = 0U;
  uint8_t subeventStepCount = 0U;
  uint8_t localChunkStartStep = 0U;
  uint8_t peerChunkStartStep = 0U;
  uint16_t procedureCounter = 0U;
  uint16_t connHandle = 0U;
  uint32_t heartbeat = 0U;
  uint32_t nextProcedureHeartbeat = 0U;
  uint32_t nextSubeventHeartbeat = 0U;
  uint32_t nextPeerStageHeartbeat = 0U;
  uint32_t nextChunkStageHeartbeat = 0U;
  uint32_t procedureIntervalTicks = 0U;
  uint32_t subeventDelayTicks = 0U;
  uint32_t peerDelayTicks = 0U;
  uint32_t chunkDelayTicks = 0U;
  uint16_t subeventEncodedStepBytes = 0U;
  uint8_t configId = 0U;
  uint8_t intervalSelector = 0U;
  uint8_t peerGapTicks = 0U;
};

struct BleCsVprMeasurementWorkItem {
  bool valid = false;
  uint8_t status = 0xFFU;
  uint8_t flags = 0U;
  bool sessionOpen = false;
  bool procedureEnabled = false;
  bool resultPending = false;
  bool peerProcedureActive = false;
  bool builtInPeerDemoEnabled = false;
  bool testActive = false;
  bool ready = false;
  bool controllerAutoExecuted = false;
  uint8_t activeSubeventIndex = 0U;
  uint8_t totalSubevents = 0U;
  uint8_t totalSteps = 0U;
  uint8_t subeventStartStep = 0U;
  uint8_t subeventStepCount = 0U;
  uint8_t localChunkStartStep = 0U;
  uint8_t peerChunkStartStep = 0U;
  uint8_t intervalSelector = 0U;
  uint16_t procedureCounter = 0U;
  uint16_t connHandle = 0U;
  uint8_t configId = 0U;
  uint8_t peerGapTicks = 0U;
  uint16_t subeventEncodedStepBytes = 0U;
  uint32_t heartbeat = 0U;
  uint32_t procedureIntervalTicks = 0U;
  uint32_t subeventDelayTicks = 0U;
  uint32_t peerDelayTicks = 0U;
  uint32_t chunkDelayTicks = 0U;
  uint32_t nextProcedureHeartbeat = 0U;
  uint32_t nextSubeventHeartbeat = 0U;
  uint32_t nextPeerStageHeartbeat = 0U;
  uint32_t nextChunkStageHeartbeat = 0U;
  uint16_t controllerAutoBlockMask = 0U;
  uint32_t controllerAutoCount = 0U;
  uint32_t controllerAutoServiceCalls = 0U;
  uint32_t controllerAutoDuePasses = 0U;
  uint16_t controllerAutoProcedureCounter = 0U;
  uint8_t controllerAutoSubevent = 0xFFU;
  uint8_t controllerAutoStatus = 0xFFU;
  uint8_t stepChannelCount = 0U;
  uint8_t stepChannels[6] = {0};
};

struct BleCsVprMeasurementExecutionResult {
  bool valid = false;
  uint8_t status = 0xFFU;
  uint8_t flags = 0U;
  bool ready = false;
  bool accepted = false;
  bool resultPending = false;
  bool peerProcedureActive = false;
  bool controllerOwnedSnapshot = false;
  uint8_t activeSubeventIndex = 0U;
  uint8_t totalSubevents = 0U;
  uint8_t totalSteps = 0U;
  uint8_t subeventStartStep = 0U;
  uint8_t subeventStepCount = 0U;
  uint8_t configId = 0U;
  uint8_t stepChannelCount = 0U;
  uint8_t executedChannelCount = 0U;
  uint16_t procedureCounter = 0U;
  uint16_t connHandle = 0U;
  uint32_t heartbeat = 0U;
  uint32_t executeCount = 0U;
  uint32_t executionToken = 0U;
  bool executionTokenValid = false;
  uint32_t rfDescriptorToken = 0U;
  uint32_t rfMinSubeventLen = 0U;
  uint32_t rfMaxSubeventLen = 0U;
  uint32_t rfNextSubeventHeartbeat = 0U;
  uint32_t rfHardwareToken = 0U;
  uint32_t rfHardwareState = 0U;
  uint32_t rfHardwareMode = 0U;
  uint32_t rfHardwareFrequency = 0U;
  uint32_t rfPrimitiveToken = 0U;
  uint32_t rfPrimitiveStateBefore = 0U;
  uint32_t rfPrimitivePllWaitLoops = 0U;
  uint32_t rfPrimitiveDisableWaitLoops = 0U;
  uint32_t rfPrimitiveStateAfter = 0U;
  uint32_t rfRetuneTargetFrequency = 0U;
  uint32_t rfRetuneTargetDatawhite = 0U;
  uint32_t rfRetuneObservedFrequency = 0U;
  uint32_t rfRetuneObservedDatawhite = 0U;
  uint32_t rfRetuneToken = 0U;
  uint32_t rfRxPrimitiveToken = 0U;
  uint32_t rfPacketConfigToken = 0U;
  uint32_t rfRxPrimitiveStateBefore = 0U;
  uint32_t rfRxPrimitiveRxReadyWaitLoops = 0U;
  uint32_t rfRxPrimitiveDisableWaitLoops = 0U;
  uint32_t rfRxPrimitiveStateAfter = 0U;
  uint32_t rfTimedMode2Token = 0U;
  uint32_t rfTimedMode2TxWaitLoops = 0U;
  uint32_t rfTimedMode2GapWaitLoops = 0U;
  uint32_t rfTimedMode2RxReadyWaitLoops = 0U;
  uint32_t rfTimedMode2ListenWaitLoops = 0U;
  uint32_t rfTimedMode2DisableWaitLoops = 0U;
  uint32_t rfTimedMode2StateAfter = 0U;
  uint32_t rfTimingOwnerToken = 0U;
  uint32_t rfTimingOwnerHeartbeat = 0U;
  uint32_t rfTimingOwnerNextProcedureHeartbeat = 0U;
  uint32_t rfTimingOwnerNextSubeventHeartbeat = 0U;
  uint32_t rfTimingOwnerProcedureIntervalTicks = 0U;
  uint32_t rfTimingOwnerSubeventDelayTicks = 0U;
  uint16_t rfPacketControlToProbeDelayUs = 0U;
  uint16_t rfPacketResponseListenWindowUs = 0U;
  uint16_t rfTimingOwnerProcedureCounter = 0U;
  uint16_t rfTimingOwnerConnHandle = 0U;
  bool rfDescriptorValid = false;
  bool rfDescriptorTokenValid = false;
  bool rfHardwareValid = false;
  bool rfHardwareTokenValid = false;
  bool rfPrimitiveValid = false;
  bool rfPrimitiveTokenValid = false;
  bool rfPrimitivePllReady = false;
  bool rfPrimitiveDisabled = false;
  bool rfRetuneValid = false;
  bool rfRetuneTokenValid = false;
  bool rfRetuneModeWritten = false;
  bool rfRetuneFrequencyWritten = false;
  bool rfRetuneDatawhiteWritten = false;
  bool rfRxPrimitiveValid = false;
  bool rfRxPrimitiveTokenValid = false;
  bool rfPacketConfigTokenValid = false;
  bool rfRxPrimitiveRxReady = false;
  bool rfRxPrimitiveDisabled = false;
  bool rfTimedMode2Valid = false;
  bool rfTimedMode2TokenValid = false;
  bool rfTimedMode2TxReady = false;
  bool rfTimedMode2TxEnd = false;
  bool rfTimedMode2RxReady = false;
  bool rfTimedMode2RxEnd = false;
  bool rfTimedMode2Disabled = false;
  bool rfTimedMode2TimingApplied = false;
  bool rfTimedMode2PacketPtrRestored = false;
  bool rfTimingOwnerValid = false;
  bool rfTimingOwnerTokenValid = false;
  bool rfTimingOwnerProcedureActive = false;
  bool rfTimingOwnerProcedureIntervalComputed = false;
  bool rfTimingOwnerSubeventDelayComputed = false;
  bool rfTimingOwnerConnectedSchedule = false;
  bool rfTimingOwnerControllerSnapshot = false;
  bool rfPacketParamsValid = false;
  bool rfPacketParamsControllerOwned = false;
  bool rfPacketParamsCteInfoIncludesType = false;
  uint8_t rfDescriptorVersion = 0U;
  uint8_t rfDescriptorFlags = 0U;
  uint8_t rfHardwareVersion = 0U;
  uint8_t rfHardwareFlags = 0U;
  uint8_t rfPrimitiveVersion = 0U;
  uint8_t rfPrimitiveFlags = 0U;
  uint8_t rfPrimitiveStatus = 0xFFU;
  uint8_t rfRetuneVersion = 0U;
  uint8_t rfRetuneFlags = 0U;
  uint8_t rfRetuneStatus = 0xFFU;
  uint8_t rfRetuneChannel = 0xFFU;
  uint8_t rfRxPrimitiveVersion = 0U;
  uint8_t rfRxPrimitiveFlags = 0U;
  uint8_t rfRxPrimitiveStatus = 0xFFU;
  uint8_t rfTimedMode2Version = 0U;
  uint8_t rfTimedMode2Flags = 0U;
  uint8_t rfTimedMode2Status = 0xFFU;
  uint8_t rfTimedMode2Channel = 0xFFU;
  uint8_t rfTimingOwnerVersion = 0U;
  uint8_t rfTimingOwnerFlags = 0U;
  uint8_t rfTimingOwnerStatus = 0xFFU;
  uint8_t rfTimingOwnerActiveSubevent = 0U;
  uint8_t rfTimingOwnerPeerGapTicks = 0U;
  uint8_t rfTimingOwnerIntervalSelector = 0U;
  uint8_t rfPacketParamsVersion = 0U;
  uint8_t rfPacketParamsFlags = 0U;
  uint8_t rfPacketS0 = 0U;
  uint8_t rfPacketCteInfo = 0U;
  uint8_t rfPacketPayloadLen = 0U;
  uint8_t rfPacketMagic0 = 0U;
  uint8_t rfPacketMagic1 = 0U;
  uint8_t rfPacketType = 0U;
  uint8_t rfPacketSequence = 0U;
  uint8_t rfPacketChannel = 0xFFU;
  uint8_t rfTimedMode2ObservedCount = 0U;
  uint8_t rfTimedMode2ObservedChannels[6] = {0};
  uint8_t rfTimedMode2ObservedStatus[6] = {0};
  uint8_t rfTimedMode2ObservedFlags[6] = {0};
  uint8_t rfTimedMode2ObservedEventMask[6] = {0};
  uint32_t rfTimedMode2ObservedTokens[6] = {0};
  uint8_t rfRole = 0U;
  uint8_t rfPhy = 0U;
  int8_t rfTxPowerDelta = 0;
  uint8_t rfRttType = 0U;
  uint8_t rfStepChannelCount = 0U;
  uint8_t stepChannels[6] = {0};
};

