lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/ble_channel_sounding.h
struct BleCsVprToneSnapshotResult {
  bool valid = false;
  bool snapshotValid = false;
  bool tokenValid = false;
  bool sampleNonZero = false;
  bool radioDisabled = false;
  bool toneConfigOk = false;
  bool timedMode2Valid = false;
  bool timedMode2TokenValid = false;
  uint8_t status = 0xFFU;
  uint8_t flags = 0U;
  uint8_t version = 0U;
  uint8_t timedMode2Version = 0U;
  uint8_t timedMode2Status = 0xFFU;
  uint8_t timedMode2Channel = 0xFFU;
  uint8_t timedMode2Flags = 0U;
  uint8_t timedMode2PacketS0 = 0U;
  uint8_t timedMode2PacketLength = 0U;
  uint8_t timedMode2PacketType = 0U;
  uint8_t timedMode2PacketSequence = 0U;
  uint8_t timedMode2PacketChannel = 0xFFU;
  uint8_t timedMode2RssiSample = 0U;
  uint8_t timedMode2CrcStatus = 0U;
  uint8_t timedMode2EventMask = 0U;
  uint32_t pct16 = 0U;
  uint32_t magPhase = 0U;
  uint32_t magStd = 0U;
  uint32_t frequency = 0U;
  uint32_t state = 0U;
  uint32_t cstonesEndEvent = 0U;
  uint32_t token = 0U;
  uint32_t timedMode2Token = 0U;
};

class BleCsControllerVprHost;

struct BleCsLlControlBridgeServiceResult {
  bool peerPduConsumed = false;
  bool initiatorPduQueued = false;
  bool initiatorPduSourceVpr = false;
  bool directCommandSent = false;
  bool exchangeComplete = false;
  uint8_t rxOpcode = 0U;
  uint8_t txOpcode = 0U;
  uint8_t directStatus = 0xFFU;
  BleCsVprPeerExchangeState peerState{};
  BleCsVprPeerExchangeState state{};
};

struct BleCsLlControlBridgePollResult {
  bool pollRan = false;
  bool eventStarted = false;
  bool csLlControlReceived = false;
  bool serviceCalled = false;
  bool preServiceCalled = false;
  bool eventServiceCalled = false;
  uint16_t eventCounter = 0U;
  uint8_t rxOpcode = 0U;
  uint8_t rxPayloadLength = 0U;
  BleCsLlControlBridgeServiceResult service{};
  BleCsLlControlBridgeServiceResult preService{};
  BleCsLlControlBridgeServiceResult eventService{};
};

struct BleCsLlControlBridgeWorkflowTracker {
  enum WorkflowBit : uint8_t {
    kWorkflowRemoteCapabilities = 0U,
    kWorkflowDefaults,
    kWorkflowConfig,
    kWorkflowSecurity,
    kWorkflowProcedureParams,
    kWorkflowProcedureEnabled,
    kWorkflowReady,
  };

  enum TxBit : uint8_t {
    kTxCsReq = 0U,
    kTxSecReq,
    kTxProcReq,
  };

  enum RxBit : uint8_t {
    kRxCsRsp = 0U,
    kRxCsCfg,
    kRxSecRsp,
    kRxProcRsp,
    kRxStart,
    kRxAbort,
  };

  uint32_t workflowMask = 0U;
  uint32_t txMask = 0U;
  uint32_t rxMask = 0U;
  uint32_t linkEvents = 0U;
  uint32_t txQueued = 0U;
  uint32_t vprPduQueued = 0U;
  uint32_t peerPdusConsumed = 0U;
  uint32_t directCommands = 0U;
  uint16_t polls = 0U;
  uint16_t completedProcedureCounter = 0U;
  uint32_t localSubeventResults = 0U;
  uint32_t peerSubeventResults = 0U;
  bool resultPathComplete = false;
  bool exchangeComplete = false;
  bool ready = false;
  bool estimateValid = false;
  uint8_t lastRxOpcode = 0U;
  uint8_t lastTxOpcode = 0U;
  uint8_t lastDirectStatus = 0xFFU;
  uint8_t lastVprStage = 0xFFU;
  uint8_t lastVprStatus = 0xFFU;

  void reset();
  void update(const BleCsControllerVprHost& host,
              const BleCsLlControlBridgePollResult& poll);
  bool workflowComplete() const;
  bool txComplete() const;
  bool rxComplete() const;
  bool complete() const;
};

enum class BleCsControllerResultSource : uint8_t {
  kLocal = 0U,
  kPeer,
};

enum class BleCsControllerIngressSource : uint8_t {
  kController = 0U,
  kLocalResult,
  kPeerResult,
};

struct BleCsControllerCapabilities {
  bool valid = false;
  bool isV2 = false;
  uint8_t status = 0U;
  uint16_t connHandle = 0U;
  uint8_t numConfigSupported = 0U;
  uint16_t maxConsecutiveProceduresSupported = 0U;
  uint8_t numAntennasSupported = 0U;
  uint8_t maxAntennaPathsSupported = 0U;
  bool initiatorSupported = false;
  bool reflectorSupported = false;
  bool mode3Supported = false;
  uint8_t rttCapability = 0U;
  uint8_t rttAaOnlyN = 0U;
  uint8_t rttSoundingN = 0U;
  uint8_t rttRandomPayloadN = 0U;
  uint16_t nadmSoundingCapability = 0U;
  uint16_t nadmRandomCapability = 0U;
  bool csSync2mPhySupported = false;
  bool csSync2m2btPhySupported = false;
  bool csWithoutFaeSupported = false;
  bool chselAlg3cSupported = false;
  bool pbrFromRttSoundingSeqSupported = false;
  bool csIptReflectorSupported = false;
  uint16_t tIp1TimesSupported = 0U;
  uint16_t tIp2TimesSupported = 0U;
  uint16_t tFcsTimesSupported = 0U;
  uint16_t tPmTimesSupported = 0U;
  uint8_t tSwTimeSupported = 0U;
  uint8_t txSnrCapability = 0U;
  uint16_t tIp2IptTimesSupported = 0U;
  uint8_t tSwIptTimeSupported = 0U;
};

struct BleCsDefaultSettings {
  bool enableInitiatorRole = false;
  bool enableReflectorRole = false;
  uint8_t csSyncAntennaSelection = 0xFFU;
  int8_t maxTxPowerDbm = 0;
};

struct BleCsControllerCreateConfig {
  uint8_t configId = 0U;
  uint8_t createContext = 0U;
  uint8_t mainModeType = 0U;
  uint8_t subModeType = 0U;
  uint8_t minMainModeSteps = 0U;
  uint8_t maxMainModeSteps = 0U;
  uint8_t mainModeRepetition = 0U;
  uint8_t mode0Steps = 0U;
  uint8_t role = 0U;
  uint8_t rttType = 0U;
  uint8_t csSyncPhy = 0U;
  uint8_t channelMap[kBleCsChannelMapBytes] = {0};
  uint8_t channelMapRepetition = 0U;
  uint8_t channelSelectionType = 0U;
  uint8_t ch3cShape = 0U;
  uint8_t ch3cJump = 0U;
  uint8_t csEnhancements1 = 0U;
};

struct BleCsProcedureParameters {
  uint8_t configId = 0U;
  uint16_t maxProcedureLen = 0U;
  uint16_t minProcedureInterval = 0U;
  uint16_t maxProcedureInterval = 0U;
  uint16_t maxProcedureCount = 0U;
  uint32_t minSubeventLen = 0U;
  uint32_t maxSubeventLen = 0U;
  uint8_t toneAntennaConfigSelection = 0U;
  uint8_t phy = 0U;
  int8_t txPowerDelta = 0;
  uint8_t preferredPeerAntenna = 0U;
  uint8_t snrControlInitiator = 0U;
  uint8_t snrControlReflector = 0U;
};

struct BleCsProcedureEnable {
  uint8_t configId = 0U;
  uint8_t enable = 0U;
};

struct BleCsSecurityEnableComplete {
  uint8_t status = 0U;
  uint16_t connHandle = 0U;
};

struct BleCsConfigComplete {
  uint8_t status = 0U;
  uint16_t connHandle = 0U;
  uint8_t configId = 0U;
  uint8_t action = 0U;
  uint8_t mainModeType = 0U;
  uint8_t subModeType = 0U;
  uint8_t minMainModeSteps = 0U;
  uint8_t maxMainModeSteps = 0U;
  uint8_t mainModeRepetition = 0U;
  uint8_t mode0Steps = 0U;
  uint8_t role = 0U;
  uint8_t rttType = 0U;
  uint8_t csSyncPhy = 0U;
  uint8_t channelMap[kBleCsChannelMapBytes] = {0};
  uint8_t channelMapRepetition = 0U;
  uint8_t channelSelectionType = 0U;
  uint8_t ch3cShape = 0U;
  uint8_t ch3cJump = 0U;
  uint8_t csEnhancements1 = 0U;
  uint8_t tIp1TimeUs = 0U;
  uint8_t tIp2TimeUs = 0U;
  uint8_t tFcsTimeUs = 0U;
  uint8_t tPmTimeUs = 0U;
};

