lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/ble_channel_sounding.h
struct BleCsProcedureEnableComplete {
  uint8_t status = 0U;
  uint16_t connHandle = 0U;
  uint8_t configId = 0U;
  uint8_t state = 0U;
  uint8_t toneAntennaConfigSelection = 0U;
  int8_t selectedTxPower = 0;
  uint32_t subeventLen = 0U;
  uint8_t subeventsPerEvent = 0U;
  uint16_t subeventInterval = 0U;
  uint16_t eventInterval = 0U;
  uint16_t procedureInterval = 0U;
  uint16_t procedureCount = 0U;
  uint16_t maxProcedureLen = 0U;
};

// ─── Zephyr Parity: CS Test Mode ─────────────────────────────────

struct BleCsTestParams {
  uint8_t mainModeType = kBleCsMainMode2;
  uint8_t subModeType = 0xFFU;
  uint8_t mainModeRepetition = 1U;
  uint8_t mode0Steps = 0U;
  uint8_t role = 0U;
  uint8_t rttType = 0U;
  uint8_t csSyncPhy = 1U;
  uint8_t csSyncAntennaSelection = 0xFFU;
  uint32_t subeventLenUs = 1250U;
  uint16_t subeventInterval = 0U;
  uint8_t maxNumSubevents = 1U;
  uint8_t transmitPowerLevel = 0x7FU;
  uint8_t tIp1TimeUs = 10U;
  uint8_t tIp2TimeUs = 10U;
  uint8_t tFcsTimeUs = 15U;
  uint8_t tPmTimeUs = 10U;
  uint8_t tSwTimeUs = 0U;
  uint8_t toneAntennaConfigSelection = 0U;
  uint8_t csEnhancements1 = 0U;
  uint8_t snrControlInitiator = 0xFFU;
  uint8_t snrControlReflector = 0xFFU;
  uint16_t drbgNonce = 0U;
  uint8_t channelMapRepetition = 1U;
  uint16_t overrideConfig = 0U;

  // Override 0 always contributes data: a channel list when bit 0 is set,
  // otherwise a channel map and channel-selection parameters.
  uint8_t overrideChannelList[kBleCsMaxTestChannelCount] = {0};
  uint8_t overrideChannelListLen = 0U;
  uint8_t channelMap[kBleCsChannelMapBytes] = {0};
  uint8_t channelSelectionType = 0U;
  uint8_t ch3cShape = 0U;
  uint8_t ch3cJump = 2U;

  uint8_t overrideMainModeSteps = 0U;
  uint8_t overrideTpmToneExtension = 0U;
  uint8_t overrideToneAntennaPermutationIndex = 0U;
  uint32_t overrideCsSyncAccessAddressInitiator = 0U;
  uint32_t overrideCsSyncAccessAddressReflector = 0U;
  uint8_t overrideSsMarkerPositions[2] = {0};
  uint8_t overrideSsMarkerValue = 0U;
  uint8_t overrideCsSyncPayloadPattern = 0U;
  uint8_t overrideCsSyncUserPayload[16] = {0};
};

struct BleCsTestEndComplete {
  uint8_t status = 0U;
};

using BleCsTestComplete = BleCsTestEndComplete;

// ─── Zephyr Parity: Channel Classification ───────────────────────

struct BleCsChannelClassification {
  uint8_t channelMap[kBleCsChannelMapBytes] = {0};
};

// ─── Zephyr Parity: FAE Table ────────────────────────────────────

struct BleCsFaeTable {
  bool valid = false;
  uint8_t status = 0U;
  uint16_t connHandle = 0U;
  int8_t values[kBleCsFaeTableValueCount] = {0};
};

// ─── Zephyr Parity: Cached Capabilities ──────────────────────────

struct BleCsCachedCapabilities {
  uint16_t connHandle = 0U;
  BleCsControllerCapabilities capabilities{};
};

enum class BleCsControllerWorkflowPhase : uint8_t {
  kIdle = 0U,
  kNeedReadRemoteCapabilities,
  kWaitingRemoteCapabilities,
  kNeedSetDefaultSettings,
  kWaitingSetDefaultSettings,
  kNeedCreateConfig,
  kWaitingConfigComplete,
  kNeedSecurityEnable,
  kWaitingSecurityEnableComplete,
  kNeedSetProcedureParameters,
  kWaitingSetProcedureParameters,
  kNeedProcedureEnable,
  kWaitingProcedureEnableComplete,
  kReady,
  kFailed,
};

struct BleCsControllerWorkflowConfig {
  BleCsDefaultSettings defaultSettings{};
  BleCsControllerCreateConfig createConfig{};
  BleCsProcedureParameters procedureParameters{};
  BleCsProcedureEnable procedureEnable{};
  bool applyDefaultSettings = true;
  bool requireSecurityEnable = true;
};

struct BleCsControllerWorkflowState {
  BleCsControllerWorkflowPhase phase = BleCsControllerWorkflowPhase::kIdle;
  uint16_t connHandle = 0U;
  uint16_t lastOpcode = 0U;
  uint8_t lastStatus = 0U;
  bool remoteCapabilitiesValid = false;
  bool defaultSettingsApplied = false;
  bool configCreated = false;
  bool securityEnabled = false;
  bool procedureParametersApplied = false;
  bool procedureEnabled = false;
  BleCsControllerCapabilities remoteCapabilities{};
  BleCsConfigComplete configComplete{};
  BleCsProcedureEnableComplete procedureEnableComplete{};
};

struct BleCsConfig {
  uint32_t accessAddress = 0xA7DCE5B3UL;
  uint32_t crcInit = 0x445566UL;
  int8_t txPowerDbm = NRF54L15_CLEAN_BLE_DEFAULT_TX_DBM;
  uint8_t cteTimeUnits = 10U;
  uint8_t maxPayloadLength = 32U;
  uint8_t s0Pattern = 0xA5U;
  uint8_t controlChannel = 37U;
  uint16_t controlToProbeDelayUs = 2400U;
  uint16_t probeToReportDelayUs = 1200U;
  uint16_t controlListenWindowUs = 20000U;
  uint16_t probeListenWindowUs = 8000U;
  uint16_t responseListenWindowUs = 12000U;
  uint8_t probeRetries = 4U;
  uint16_t minToneMagnitude = 16U;
  // Bare RADIO RTT AUXDATA layout/channel semantics are not publicly documented
  // well enough to decode reliable ranging results in this clean-core path.
  bool enableRtt = false;
  bool rttFullAccessAddress = true;
  uint8_t rttNumSegments = 0U;
  uint16_t rttEfsDelay = 64U;
  float rttDistanceOffsetMeters = 0.0f;
  bool enableRawDfeCapture = false;
  uint8_t dfeSwitchPatternCount = 0U;
  uint8_t dfeSwitchPattern[kBleCsMaxSwitchPatternCount] = {0};
  uint8_t dfeRepeatPattern = 0U;
  int16_t dfeSwitchOffset16M = 0;
  int16_t dfeSampleOffset16M = 0;
};

struct BleCsMeasurementExecuteParams {
  uint8_t packetS0 = 0xA5U;
  uint8_t packetCteInfo = 10U;
  uint16_t controlToProbeDelayUs = 2400U;
  uint16_t responseListenWindowUs = 12000U;
};

struct BleCsConnectedWindowPlan {
  bool valid = false;
  bool connected = false;
  bool fits = false;
  BleConnectionRole role = BleConnectionRole::kNone;
  uint16_t nextEventCounter = 0U;
  uint16_t intervalUnits = 0U;
  uint32_t intervalUs = 0U;
  uint32_t nowUs = 0U;
  uint32_t nextEventUs = 0U;
  uint32_t timeUntilNextEventUs = 0U;
  uint32_t startUs = 0U;
  uint32_t deadlineUs = 0U;
  uint32_t availableUs = 0U;
  uint32_t requestedWindowUs = 0U;
  uint32_t guardBeforeUs = 0U;
  uint32_t guardAfterUs = 0U;
  uint8_t reason = 0U;
};

struct BleCsConnectedWindowMeasurement {
  BleCsConnectedWindowPlan plan{};
  BleCsChannelMeasurement measurement{};
  bool attempted = false;
  bool measured = false;
  bool completedBeforeDeadline = false;
  uint8_t channelIndex = 0U;
  uint8_t sequence = 0U;
  uint32_t startDelayUs = 0U;
  uint32_t elapsedUs = 0U;
  uint32_t remainingUs = 0U;
  uint8_t reason = 0U;
};

