lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/ble_channel_sounding.h
  // ─── Zephyr Parity: FAE Table HCI ──────────────────────────
  static bool buildHciReadRemoteFaeTableCommand(uint16_t connHandle,
                                                 BleCsHciCommand* outCommand);
  static bool parseHciReadRemoteFaeTableCompleteEvent(
      const uint8_t* eventData,
      size_t eventLen,
      BleCsFaeTable* outTable);
  static bool buildHciWriteCachedRemoteFaeTableCommand(
      uint16_t connHandle,
      const int8_t faeTable[kBleCsFaeTableValueCount],
      BleCsHciCommand* outCommand);

  // ─── Zephyr Parity: Cached Capabilities HCI ────────────────
  static bool buildHciWriteCachedRemoteSupportedCapabilitiesCommand(
      uint16_t connHandle,
      const BleCsControllerCapabilities& capabilities,
      BleCsHciCommand* outCommand);
  static bool buildHciWriteCachedRemoteSupportedCapabilitiesV2Command(
      uint16_t connHandle,
      const BleCsControllerCapabilities& capabilities,
      BleCsHciCommand* outCommand);

  BleCsDfeCaptureInfo lastDfeCaptureInfo() const;
  bool copyLastDfePacket(uint8_t* outPacket,
                         size_t maxLen,
                         size_t* outLen) const;

 private:
  enum class PacketType : uint8_t {
    kControl = 0x43U,
    kProbe = 0x50U,
    kReport = 0x52U,
  };

  struct RxFrame {
    bool valid = false;
    PacketType type = PacketType::kControl;
    uint8_t sequence = 0;
    uint8_t channelIndex = 0;
    uint8_t flags = 0;
    int8_t rssiDbm = 0;
    uint8_t extra[24] = {0};
    uint8_t extraLen = 0;
  };

  bool configureBle2MCommon();
  bool setLogicalChannel(uint8_t channelIndex);
  void configureRtt(bool enabled, bool reflectorRole);
  void prepareAuxDataCapture();
  void configureTxToneExtension();
  void configureRxToneCapture();
  void clearEvents();
  bool sendFrame(uint8_t logicalChannel,
                 PacketType type,
                 uint8_t sequence,
                 uint8_t channelIndex,
                 uint8_t flags,
                 const uint8_t* extra,
                 uint8_t extraLen,
                 bool enableRtt,
                 bool rttReflectorRole);
  bool receiveFrame(uint8_t logicalChannel,
                    uint32_t listenWindowUs,
                    bool captureTone,
                    bool captureRtt,
                    bool rttReflectorRole,
                    RxFrame* outFrame,
                    BleCsToneSample* outTone,
                    BleCsRttSample* outRtt);
  bool decodeFrame(const uint8_t* packet,
                   size_t packetLen,
                   int8_t rssiDbm,
                   RxFrame* outFrame) const;
  void encodeReportExtra(const BleCsToneSample& tone, uint8_t* outExtra) const;
  void decodeReportExtra(const uint8_t* extra,
                         uint8_t extraLen,
                         BleCsToneSample* outTone) const;
  void encodeRttExtra(const BleCsRttSample& rtt, uint8_t* outExtra) const;
  void decodeRttExtra(const uint8_t* extra,
                      uint8_t extraLen,
                      BleCsRttSample* outRtt) const;
  void captureAuxDataRtt(BleCsRttSample* outRtt);
  void resetDfeCaptureState();
  void updateDfeCaptureState();
  bool deriveToneFromRawDfe(BleCsToneSample* outTone) const;
  void parseRttRaw(BleCsRttSample* outRtt) const;
  uint8_t makeCteInfo() const;

  NRF_RADIO_Type* radio_;
  PowerManager power_;
  BleCsConfig config_;
  bool initialized_;
  alignas(4) uint8_t txPacket_[3U + 48U];
  alignas(4) uint8_t rxPacket_[3U + 48U];
  alignas(4) uint8_t dfePacket_[512U];
  alignas(4) uint32_t auxDataWords_[4];
  uint16_t lastDfePacketAmountBytes_;
  uint16_t lastDfePacketCurrentAmountBytes_;
  bool lastDfePacketAllZero_;
  uint8_t lastReflectorStatus_;
  BleCsReflectorTiming lastReflectorTiming_;
};

struct BleCsConnectedMode2SweepConfig {
  const uint8_t* channels = nullptr;
  const BleCsVprMeasurementWorkItem* workItem = nullptr;
  uint8_t channelCount = 0U;
  uint8_t minValidChannels = 1U;
  uint8_t configId = 1U;
  uint8_t numAntennaPaths = 1U;
  uint8_t triggerReason = 0x7EU;
  uint8_t ackReason = 0x7DU;
  uint8_t windowEventOffset = 4U;
  uint8_t triggerAckPolls = 6U;
  uint8_t startEventPollSlack = 4U;
  uint32_t singleChannelWindowUs = 14000UL;
  uint32_t guardBeforeUs = 4000UL;
  uint32_t guardAfterUs = 4500UL;
  uint32_t pollSpinLimit = 450000UL;
  BoardAntennaPath antennaPath = BoardAntennaPath::kCeramic;
  BleCsConfig radioConfig{};
  uint8_t* inOutSequence = nullptr;
};

struct BleCsConnectedMode2ChannelResult {
  BleCsConnectedWindowMeasurement window{};
  BleCsDfeCaptureInfo dfeInfo{};
  uint8_t channel = 0U;
  uint8_t order = 0U;
  bool triggerQueued = false;
  bool triggerSent = false;
  bool triggerAcked = false;
  bool startEventSeen = false;
  bool rfPathEnabled = false;
  bool radioStarted = false;
  bool snapshotValid = false;
  bool channelOk = false;
  uint16_t triggerEventCounter = 0U;
  uint16_t ackEventCounter = 0U;
  uint16_t runAfterEventCounter = 0U;
  uint8_t reason = 0U;
};

struct BleCsConnectedMode2SweepResult {
  bool ok = false;
  bool rawEstimateValid = false;
  bool hostEstimateValid = false;
  bool workItemApplied = false;
  bool workChannelsUsed = false;
  bool workExecuteAttempted = false;
  bool workExecuteOk = false;
  bool workExecuteTokenOk = false;
  bool workRfDescriptorOk = false;
  bool workRfHardwareOk = false;
  bool workRfPrimitiveOk = false;
  bool workRfRetuneOk = false;
  bool workRfRxPrimitiveOk = false;
  bool workRfPacketConfigOk = false;
  bool workRfPacketBufferOk = false;
  bool workRfTimedMode2Ok = false;
  bool workRfTimingOwnerOk = false;
  bool workToneSnapshotOk = false;
  bool workToneTimedMode2Ok = false;
  bool workResultTimedMode2Ok = false;
  bool workResultTimedMode2LocalOk = false;
  bool workResultTimedMode2PeerOk = false;
  bool workResultTimedMode2AllChannelsOk = false;
  bool workCompletedResultEstimateValid = false;
  bool hostControllerResultIngress = false;
  uint8_t attempts = 0U;
  uint8_t validChannels = 0U;
  uint8_t sweepChannelCount = 0U;
  uint8_t workExecutionStatus = 0xFFU;
  uint8_t workExecutionFlags = 0U;
  uint8_t workExecutedChannelCount = 0U;
  uint32_t workExecuteMismatchMask = 0U;
  uint32_t workExecutionToken = 0U;
  uint32_t workRfDescriptorToken = 0U;
  uint32_t workRfHardwareToken = 0U;
  uint32_t workRfHardwareState = 0U;
  uint32_t workRfHardwareMode = 0U;
  uint32_t workRfHardwareFrequency = 0U;
  uint32_t workRfPrimitiveToken = 0U;
  uint32_t workRfPrimitiveStateBefore = 0U;
  uint32_t workRfPrimitivePllWaitLoops = 0U;
  uint32_t workRfPrimitiveDisableWaitLoops = 0U;
  uint32_t workRfPrimitiveStateAfter = 0U;
  uint32_t workRfRetuneToken = 0U;
  uint32_t workRfRetuneTargetFrequency = 0U;
  uint32_t workRfRetuneTargetDatawhite = 0U;
  uint32_t workRfRetuneObservedFrequency = 0U;
  uint32_t workRfRetuneObservedDatawhite = 0U;
  uint32_t workRfRxPrimitiveToken = 0U;
  uint32_t workRfRxPrimitiveStateBefore = 0U;
  uint32_t workRfRxPrimitiveRxReadyWaitLoops = 0U;
  uint32_t workRfRxPrimitiveDisableWaitLoops = 0U;
  uint32_t workRfRxPrimitiveStateAfter = 0U;
  uint32_t workRfPacketConfigToken = 0U;
  uint32_t workRfPacketConfigPcnf0 = 0U;
  uint32_t workRfPacketConfigPcnf1 = 0U;
  uint16_t workRfPacketControlToProbeDelayUs = 0U;
  uint16_t workRfPacketResponseListenWindowUs = 0U;
  uint32_t workRfTimedMode2Token = 0U;
  uint32_t workRfTimedMode2TxWaitLoops = 0U;
  uint32_t workRfTimedMode2GapWaitLoops = 0U;
  uint32_t workRfTimedMode2RxReadyWaitLoops = 0U;
  uint32_t workRfTimedMode2ListenWaitLoops = 0U;
  uint32_t workRfTimedMode2DisableWaitLoops = 0U;
  uint32_t workRfTimedMode2StateAfter = 0U;
  uint32_t workRfTimingOwnerToken = 0U;
  uint32_t workRfTimingOwnerHeartbeat = 0U;
  uint32_t workRfTimingOwnerNextProcedureHeartbeat = 0U;
  uint32_t workRfTimingOwnerNextSubeventHeartbeat = 0U;
  uint32_t workRfTimingOwnerProcedureIntervalTicks = 0U;
  uint32_t workRfTimingOwnerSubeventDelayTicks = 0U;
  uint32_t workToneSnapshotToken = 0U;
  uint32_t workToneSnapshotPct16 = 0U;
  uint32_t workToneSnapshotMagPhase = 0U;
  uint32_t workToneSnapshotMagStd = 0U;
  uint32_t workToneSnapshotFrequency = 0U;
  uint32_t workToneSnapshotState = 0U;
  uint32_t workToneSnapshotCstonesEndEvent = 0U;
  uint32_t workToneTimedMode2Token = 0U;
  uint32_t workRfMaxSubeventLen = 0U;
  uint8_t workRfPrimitiveStatus = 0xFFU;
  uint8_t workRfPrimitiveFlags = 0U;
  uint8_t workRfRetuneStatus = 0xFFU;
  uint8_t workRfRetuneFlags = 0U;
  uint8_t workRfRetuneChannel = 0xFFU;
  uint8_t workRfRxPrimitiveStatus = 0xFFU;
  uint8_t workRfRxPrimitiveFlags = 0U;
  uint8_t workRfPacketConfigStatus = 0xFFU;
  uint8_t workRfPacketConfigFlags = 0U;
  uint8_t workRfPacketConfigMaxPayload = 0U;
  uint8_t workRfPacketS0 = 0U;
  uint8_t workRfPacketCteInfo = 0U;
  uint8_t workRfPacketPayloadLen = 0U;
  uint8_t workRfPacketMagic0 = 0U;
  uint8_t workRfPacketMagic1 = 0U;
  uint8_t workRfPacketType = 0U;
  uint8_t workRfPacketSequence = 0U;
  uint8_t workRfPacketChannel = 0xFFU;
  uint8_t workRfTimedMode2Status = 0xFFU;
  uint8_t workRfTimedMode2Flags = 0U;
  uint8_t workRfTimedMode2Channel = 0xFFU;
  uint8_t workRfTimingOwnerStatus = 0xFFU;
  uint8_t workRfTimingOwnerFlags = 0U;
  uint8_t workRfTimingOwnerSubevent = 0U;
  uint8_t workRfTimingOwnerPeerGapTicks = 0U;
  uint8_t workRfTimingOwnerIntervalSelector = 0U;
  uint8_t workToneSnapshotStatus = 0xFFU;
  uint8_t workToneSnapshotFlags = 0U;
  uint8_t workToneTimedMode2Status = 0xFFU;
  uint8_t workToneTimedMode2Flags = 0U;
  uint8_t workToneTimedMode2Channel = 0xFFU;
  uint8_t workToneTimedMode2PacketType = 0U;
  uint8_t workToneTimedMode2PacketChannel = 0xFFU;
  uint8_t workToneTimedMode2EventMask = 0U;
  uint8_t workResultTimedMode2Channel = 0xFFU;
  uint8_t workResultTimedMode2RequiredChannels = 0U;
  uint8_t workResultTimedMode2LocalMatches = 0U;
  uint8_t workResultTimedMode2PeerMatches = 0U;
  uint8_t workRfTimedMode2ObservedCount = 0U;
  uint8_t workRfTimedMode2ObservedChannels[6] = {0};
  uint8_t workRfTimedMode2ObservedStatus[6] = {0};
  uint8_t workRfTimedMode2ObservedFlags[6] = {0};
  uint8_t workRfTimedMode2ObservedEventMask[6] = {0};
  uint32_t workRfTimedMode2ObservedTokens[6] = {0};
  uint32_t workCompletedResultMismatchMask = 0U;
  uint8_t workRfPhy = 0U;
  int8_t workRfTxPowerDelta = 0;
  uint32_t hostLocalResultPacketDelta = 0U;
  uint32_t hostPeerResultPacketDelta = 0U;
  uint32_t hostControllerEventPacketDelta = 0U;
  uint32_t hostPeerResultMarkerDelta = 0U;
  uint16_t workDirectDrainPackets = 0U;
  uint16_t workDirectDrainConsumed = 0U;
  uint16_t workDirectDrainRejected = 0U;
  uint16_t workDirectDrainReadFailures = 0U;
  uint16_t workDirectDrainLastLen = 0U;
  uint16_t workDirectDrainFirstRejectedLen = 0U;
  uint16_t workDirectDrainFirstRejectedConnHandle = 0U;
  uint16_t workDirectDrainFirstRejectedProcedureCounter = 0U;
  uint16_t workDirectDrainFirstRejectedResultLen = 0U;
  uint16_t workDirectDrainFirstRejectedResultConnHandle = 0U;
  uint16_t workDirectDrainFirstRejectedResultProcedureCounter = 0U;
  uint8_t workDirectDrainLastEvent = 0U;
  uint8_t workDirectDrainLastSubevent = 0U;
  uint8_t workDirectDrainLastVendor = 0U;
  uint8_t workDirectDrainFirstRejectedEvent = 0U;
  uint8_t workDirectDrainFirstRejectedSubevent = 0U;
  uint8_t workDirectDrainFirstRejectedConfigId = 0U;
  uint8_t workDirectDrainFirstRejectedSteps = 0U;
  uint8_t workDirectDrainFirstRejectedProcedureDone = 0U;
  uint8_t workDirectDrainFirstRejectedSubeventDone = 0U;
  uint8_t workDirectDrainFirstRejectedResultSubevent = 0U;
  uint8_t workDirectDrainFirstRejectedResultConfigId = 0U;
  uint8_t workDirectDrainFirstRejectedResultSteps = 0U;
  uint8_t workDirectDrainFirstRejectedResultProcedureDone = 0U;
  uint8_t workDirectDrainFirstRejectedResultSubeventDone = 0U;
  uint8_t workConfigId = 0U;
  uint8_t workSubeventIndex = 0U;
  uint8_t workSubeventCount = 0U;
  uint8_t workSubeventStepCount = 0U;
  uint8_t workTotalSteps = 0U;
  uint8_t workStepChannelCount = 0U;
  uint8_t workStepChannels[6] = {0};
  uint16_t workProcedureCounter = 0U;
  uint8_t workCompletedResultConfigId = 0U;
  uint16_t workCompletedResultProcedureCounter = 0U;
  uint16_t workCompletedResultLocalSteps = 0U;
  uint16_t workCompletedResultPeerSteps = 0U;
  uint8_t hostConfigId = 0U;
  uint16_t hostProcedureCounter = 0U;
  uint16_t hostLocalSteps = 0U;
  uint16_t hostPeerSteps = 0U;
  BleCsEstimate rawEstimate{};
  BleCsConnectedMode2ChannelResult lastChannel{};
};

struct BleCsControllerVprDrainStats {
  uint16_t packetsRead = 0U;
  uint16_t packetsConsumed = 0U;
  uint16_t packetsRejected = 0U;
  uint16_t readFailures = 0U;
  uint16_t pendingPacketsPopped = 0U;
  uint16_t lastPacketLen = 0U;
  uint16_t firstRejectedPacketLen = 0U;
  uint16_t firstRejectedConnHandle = 0U;
  uint16_t firstRejectedProcedureCounter = 0U;
  uint16_t firstRejectedResultPacketLen = 0U;
  uint16_t firstRejectedResultConnHandle = 0U;
  uint16_t firstRejectedResultProcedureCounter = 0U;
  uint8_t firstRejectedConfigId = 0U;
  uint8_t firstRejectedSteps = 0U;
  uint8_t firstRejectedResultConfigId = 0U;
  uint8_t firstRejectedResultSteps = 0U;
  uint8_t lastEventCode = 0U;
  uint8_t lastLeSubeventCode = 0U;
  uint8_t lastVendorSubeventCode = 0U;
  uint8_t firstRejectedEventCode = 0U;
  uint8_t firstRejectedLeSubeventCode = 0U;
  uint8_t firstRejectedProcedureDoneStatus = 0U;
  uint8_t firstRejectedSubeventDoneStatus = 0U;
  uint8_t firstRejectedResultLeSubeventCode = 0U;
  uint8_t firstRejectedResultProcedureDoneStatus = 0U;
  uint8_t firstRejectedResultSubeventDoneStatus = 0U;
};

using BleCsConnectedMode2ChannelCallback =
    void (*)(const BleCsConnectedMode2ChannelResult& result,
             void* userData);

