lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/ble_channel_sounding.h
class BleCsConnectedMode2SweepRunner {
 public:
  static bool runInitiator(
      BleRadio& ble,
      BleChannelSoundingRadio& radio,
      BleCsControllerVprHost* host,
      const BleCsConnectedMode2SweepConfig& config,
      BleCsChannelMeasurement* measurements,
      uint8_t* localStepData,
      size_t localMaxStepDataLen,
      uint8_t* peerStepData,
      size_t peerMaxStepDataLen,
      BleCsConnectedMode2SweepResult* outResult,
      BleCsConnectedMode2ChannelCallback channelCallback = nullptr,
      void* channelCallbackUserData = nullptr);
};

class BleCsSubeventResultReassembler {
 public:
  BleCsSubeventResultReassembler();

  void reset();
  bool active() const;

  bool consumeInitialEvent(const uint8_t* eventData,
                           size_t eventLen,
                           BleCsSubeventResult* outResult);
  bool consumeContinuationEvent(const uint8_t* eventData,
                                size_t eventLen,
                                BleCsSubeventResult* outResult);

 private:
  static constexpr size_t kMaxStepDataBytes = kBleCsMaxControllerStepDataBytes;

  bool appendStepData(const uint8_t* data, size_t len);
  void fillOutput(bool complete,
                  bool continuation,
                  BleCsSubeventResult* outResult) const;

  BleCsSubeventResultHeader header_;
  uint8_t stepData_[kMaxStepDataBytes];
  uint16_t stepDataLen_;
  bool active_;
};

class BleCsControllerWorkflow {
 public:
  BleCsControllerWorkflow();

  void reset();
  bool begin(uint16_t connHandle, const BleCsControllerWorkflowConfig& config);

  bool active() const;
  bool ready() const;
  bool failed() const;

  BleCsControllerWorkflowPhase phase() const;
  const BleCsControllerWorkflowState& state() const;
  const BleCsControllerWorkflowConfig& config() const;

  bool buildNextCommand(BleCsHciCommand* outCommand);
  bool acknowledgeCommandStatus(uint16_t opcode, uint8_t status);
  bool consumeEvent(uint8_t subeventCode, const uint8_t* eventData, size_t eventLen);
  bool consumeHciEventPacket(const uint8_t* packet, size_t packetLen);
  void reconcileReadyShadowState(uint8_t selectedConfigId,
                                 bool sessionOpen,
                                 bool configCreated,
                                 bool securityEnabled,
                                 bool procedureParametersApplied,
                                 bool procedureEnabled);

  static const char* phaseName(BleCsControllerWorkflowPhase phase);

 private:
  static bool validateConfigAgainstCapabilities(
      const BleCsControllerWorkflowConfig& config,
      const BleCsControllerCapabilities& capabilities);
  bool acknowledgeReadyCommandStatus(uint16_t opcode, uint8_t status);
  bool consumeReadyEvent(uint8_t subeventCode, const uint8_t* eventData, size_t eventLen);
  void fail(uint8_t status);

  BleCsControllerWorkflowConfig config_;
  BleCsControllerWorkflowState state_;
};

class BleHciPacketStreamDecoder {
 public:
  BleHciPacketStreamDecoder();

  void reset();
  void setAcceptedPacketTypes(uint32_t acceptedTypes);
  uint32_t acceptedPacketTypes() const;
  uint32_t deliveredPacketCount() const;
  uint32_t ignoredPacketCount() const;
  uint32_t ignoredByteCount() const;
  bool pushBytes(const uint8_t* data,
                 size_t len,
                 bool (*onPacket)(const uint8_t* packet, size_t packetLen, void* userData),
                 void* userData);

 private:
  static constexpr size_t kMaxPacketBytes = 1100U;

  static uint32_t packetTypeMask(uint8_t packetType);
  bool expectedLengthKnown() const;
  bool determineExpectedLength();
  bool packetTypeAccepted() const;
  void resetBuffer();

  uint8_t buffer_[kMaxPacketBytes];
  size_t used_;
  size_t expected_;
  uint32_t acceptedTypes_;
  uint32_t deliveredPackets_;
  uint32_t ignoredPackets_;
  uint32_t ignoredBytes_;
};

struct BleCsControllerSessionConfig {
  BleCsControllerWorkflowConfig workflow{};
  bool localRoleIsInitiator = true;
};

struct BleCsControllerSessionState {
  bool workflowReady = false;
  bool localResultComplete = false;
  bool peerResultComplete = false;
  bool estimateValid = false;
  uint16_t completedProcedureCounter = 0U;
  uint16_t completedConfigId = 0U;
  uint32_t workflowIgnoredPackets = 0U;
  uint32_t localIgnoredPackets = 0U;
  uint32_t peerIgnoredPackets = 0U;
  uint32_t workflowIgnoredBytes = 0U;
  uint32_t localIgnoredBytes = 0U;
  uint32_t peerIgnoredBytes = 0U;
  BleCsEstimate estimate{};
};

class BleCsControllerSession {
 public:
  BleCsControllerSession();

  void reset();
  bool begin(uint16_t connHandle, const BleCsControllerSessionConfig& config);

  bool buildNextCommandPacket(uint8_t* outPacket, size_t maxLen, size_t* outLen);
  bool consumeWorkflowEventPacket(const uint8_t* packet, size_t packetLen);
  bool consumeWorkflowStreamBytes(const uint8_t* data, size_t len);
  bool consumeResultEventPacket(BleCsControllerResultSource source,
                                const uint8_t* packet,
                                size_t packetLen);
  bool consumeResultStreamBytes(BleCsControllerResultSource source,
                                const uint8_t* data,
                                size_t len);
  bool consumeCompletedResult(BleCsControllerResultSource source,
                              const BleCsSubeventResult& result);

  bool ready() const;
  bool failed() const;
  bool estimateValid() const;
  bool refreshEstimateFromCompletedResults();
  bool applyEstimateToCompletedResults(const BleCsEstimate& estimate);
  const BleCsControllerSessionState& state() const;
  const BleCsControllerWorkflowState& workflowState() const;
  const BleCsSubeventResult& localResult() const;
  const BleCsSubeventResult& peerResult() const;
  const BleCsSubeventResult& completedLocalResult() const;
  const BleCsSubeventResult& completedPeerResult() const;
  void resetProcedureRunState();
  void reconcileReadyWorkflowShadow(uint8_t selectedConfigId,
                                    bool sessionOpen,
                                    bool configCreated,
                                    bool securityEnabled,
                                    bool procedureParametersApplied,
                                    bool procedureEnabled);
  /* Most recently consumed subevent result abort reasons (0 = no abort).
   * Updated by accumulateProcedureResult() whenever a result carries a
   * non-zero abort reason. */
  uint8_t lastProcedureAbortReason() const;
  uint8_t lastSubeventAbortReason() const;

