lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/ble_channel_sounding.h
 private:
  static bool onWorkflowPacket(const uint8_t* packet, size_t packetLen, void* userData);
  static bool onLocalResultPacket(const uint8_t* packet, size_t packetLen, void* userData);
  static bool onPeerResultPacket(const uint8_t* packet, size_t packetLen, void* userData);
  bool consumeResultPacket(BleCsControllerResultSource source,
                           const uint8_t* packet,
                           size_t packetLen);
  void resetAccumulatedProcedureResults();
  void resetAccumulatedProcedureResult(BleCsControllerResultSource source);
  bool accumulateProcedureResult(BleCsControllerResultSource source,
                                 const BleCsSubeventResult& result);
  bool snapshotCompletedResultPair(const BleCsSubeventResult& localResult,
                                   const BleCsSubeventResult& peerResult);
  void updateEstimateIfComplete();

  BleCsControllerSessionConfig config_;
  BleCsControllerSessionState state_;
  BleCsControllerWorkflow workflow_;
  BleHciPacketStreamDecoder workflowDecoder_;
  BleHciPacketStreamDecoder localDecoder_;
  BleHciPacketStreamDecoder peerDecoder_;
  BleCsSubeventResultReassembler localReassembler_;
  BleCsSubeventResultReassembler peerReassembler_;
  BleCsSubeventResult localResult_;
  BleCsSubeventResult peerResult_;
  BleCsSubeventResult accumulatedLocalResult_;
  BleCsSubeventResult accumulatedPeerResult_;
  BleCsSubeventResult completedLocalResult_;
  BleCsSubeventResult completedPeerResult_;
  uint8_t accumulatedLocalStepData_[kBleCsMaxControllerStepDataBytes];
  uint8_t accumulatedPeerStepData_[kBleCsMaxControllerStepDataBytes];
  uint8_t completedLocalStepData_[kBleCsMaxControllerStepDataBytes];
  uint8_t completedPeerStepData_[kBleCsMaxControllerStepDataBytes];
  uint8_t lastProcedureAbortReason_ = 0U;
  uint8_t lastSubeventAbortReason_ = 0U;
};

using BleCsControllerSendPacketCallback =
    bool (*)(const uint8_t* packet, size_t packetLen, void* userData);

struct BleCsControllerHostConfig {
  BleCsControllerSessionConfig session{};
  BleCsControllerSendPacketCallback sendPacket = nullptr;
  void* userData = nullptr;
};

struct BleCsControllerHostState {
  bool began = false;
  uint32_t sentCommandPackets = 0U;
  uint32_t sentCommandBytes = 0U;
  uint16_t lastCommandOpcode = 0U;
  uint32_t controllerEventPackets = 0U;
  uint32_t localResultPackets = 0U;
  uint32_t peerResultPackets = 0U;
  uint32_t localSubeventResults = 0U;
  uint32_t peerSubeventResults = 0U;
  uint32_t vendorPeerResultTriggers = 0U;
  uint32_t controllerPeerResultMarkers = 0U;
  uint8_t vendorPeerResultConfigId = 0U;
  uint16_t vendorPeerResultProcedureCounter = 0U;
  uint32_t controllerIgnoredPackets = 0U;
  uint32_t controllerIgnoredBytes = 0U;
};

class BleCsControllerHost {
 public:
  BleCsControllerHost();

  void reset();
  bool begin(uint16_t connHandle, const BleCsControllerHostConfig& config);

  bool pumpCommands(uint8_t maxCommands = 1U);
  bool consumeIngressPacket(BleCsControllerIngressSource source,
                            const uint8_t* packet,
                            size_t packetLen);
  bool consumeIngressBytes(BleCsControllerIngressSource source,
                           const uint8_t* data,
                           size_t len);
  bool consumeCompletedResult(BleCsControllerResultSource source,
                              const BleCsSubeventResult& result);
  bool consumeResultEventStream(BleCsControllerResultSource source,
                                const BleCsSubeventResult& result);
  bool consumeMode2ResultsFromMeasurements(
      const BleCsChannelMeasurement* measurements,
      size_t count,
      const BleCsSubeventResultHeader& headerTemplate,
      uint8_t* localStepData,
      size_t localMaxStepDataLen,
      uint8_t* peerStepData,
      size_t peerMaxStepDataLen);
  bool consumeMode2ResultEventsFromMeasurements(
      const BleCsChannelMeasurement* measurements,
      size_t count,
      const BleCsSubeventResultHeader& headerTemplate,
      uint8_t* localStepData,
      size_t localMaxStepDataLen,
      uint8_t* peerStepData,
      size_t peerMaxStepDataLen);
  bool consumeMode2ControllerEventsFromMeasurements(
      const BleCsChannelMeasurement* measurements,
      size_t count,
      const BleCsSubeventResultHeader& headerTemplate,
      uint8_t* localStepData,
      size_t localMaxStepDataLen,
      uint8_t* peerStepData,
      size_t peerMaxStepDataLen);

  bool ready() const;
  bool failed() const;
  bool estimateValid() const;
  bool refreshEstimateFromCompletedResults();
  bool applyEstimateToCompletedResults(const BleCsEstimate& estimate);
  const BleCsControllerHostState& state() const;
  const BleCsControllerSessionState& sessionState() const;
  const BleCsControllerWorkflowState& workflowState() const;
  const BleCsSubeventResult& localResult() const;
  const BleCsSubeventResult& peerResult() const;
  const BleCsSubeventResult& completedLocalResult() const;
  const BleCsSubeventResult& completedPeerResult() const;
  void resetProcedureRunState();
  void reconcileReadyWorkflowShadow(uint8_t selectedConfigId,
                                    bool sessionOpen,
                                    bool configCreated,
                                    bool securityEnabled,
                                    bool procedureParametersApplied,
                                    bool procedureEnabled);
  uint8_t lastProcedureAbortReason() const;
  uint8_t lastSubeventAbortReason() const;

 private:
  static bool onControllerPacket(const uint8_t* packet, size_t packetLen, void* userData);
  static bool onLocalPacket(const uint8_t* packet, size_t packetLen, void* userData);
  static bool onPeerPacket(const uint8_t* packet, size_t packetLen, void* userData);

  BleCsControllerHostConfig config_;
  BleCsControllerHostState state_;
  BleCsControllerSession session_;
  BleHciPacketStreamDecoder controllerDecoder_;
  BleHciPacketStreamDecoder localDecoder_;
  BleHciPacketStreamDecoder peerDecoder_;
  bool controllerPeerResultsExpected_ = false;
};

struct BleCsControllerStreamHostConfig {
  BleCsControllerSessionConfig session{};
  ::Stream* controllerStream = nullptr;
  ::Stream* peerResultStream = nullptr;
  uint8_t maxCommandsPerPump = 1U;
  size_t maxControllerBytesPerPoll = 128U;
  size_t maxPeerBytesPerPoll = 128U;
};

struct BleCsControllerStreamHostState {
  uint32_t controllerBytesRead = 0U;
  uint32_t peerBytesRead = 0U;
  uint32_t controllerPacketsWritten = 0U;
  uint32_t controllerBytesWritten = 0U;
  uint8_t lastWriteError = 0U;
};

class BleCsControllerStreamHost {
 public:
  BleCsControllerStreamHost();

  void reset();
  bool begin(uint16_t connHandle, const BleCsControllerStreamHostConfig& config);
  bool pumpCommands();
  bool pollController();
  bool pollPeerResults();
  bool consumeControllerPacket(const uint8_t* packet, size_t packetLen);
  bool consumePeerPacket(const uint8_t* packet, size_t packetLen);
  bool consumeCompletedResult(BleCsControllerResultSource source,
                              const BleCsSubeventResult& result);
  bool consumeMode2ResultsFromMeasurements(
      const BleCsChannelMeasurement* measurements,
      size_t count,
      const BleCsSubeventResultHeader& headerTemplate,
      uint8_t* localStepData,
      size_t localMaxStepDataLen,
      uint8_t* peerStepData,
      size_t peerMaxStepDataLen);
  bool consumeMode2ResultEventsFromMeasurements(
      const BleCsChannelMeasurement* measurements,
      size_t count,
      const BleCsSubeventResultHeader& headerTemplate,
      uint8_t* localStepData,
      size_t localMaxStepDataLen,
      uint8_t* peerStepData,
      size_t peerMaxStepDataLen);
  bool consumeMode2ControllerEventsFromMeasurements(
      const BleCsChannelMeasurement* measurements,
      size_t count,
      const BleCsSubeventResultHeader& headerTemplate,
      uint8_t* localStepData,
      size_t localMaxStepDataLen,
      uint8_t* peerStepData,
      size_t peerMaxStepDataLen);
  bool poll();
  bool loopOnce();

  bool ready() const;
  bool failed() const;
  bool estimateValid() const;
  bool refreshEstimateFromCompletedResults();
  bool applyEstimateToCompletedResults(const BleCsEstimate& estimate);
  const BleCsControllerStreamHostState& state() const;
  const BleCsControllerHostState& hostState() const;
  const BleCsControllerSessionState& sessionState() const;
  const BleCsControllerWorkflowState& workflowState() const;
  const BleCsSubeventResult& localResult() const;
  const BleCsSubeventResult& peerResult() const;
  const BleCsSubeventResult& completedLocalResult() const;
  const BleCsSubeventResult& completedPeerResult() const;
  void resetProcedureRunState();
  void reconcileReadyWorkflowShadow(uint8_t selectedConfigId,
                                    bool sessionOpen,
                                    bool configCreated,
                                    bool securityEnabled,
                                    bool procedureParametersApplied,
                                    bool procedureEnabled);
  uint8_t lastProcedureAbortReason() const;
  uint8_t lastSubeventAbortReason() const;

