lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/ble_channel_sounding.h
 private:
  static bool onSendPacket(const uint8_t* packet, size_t packetLen, void* userData);
  static size_t clampPollBytes(size_t value);

  BleCsControllerStreamHostConfig config_;
  BleCsControllerStreamHostState state_;
  BleCsControllerHost host_;
};

struct BleCsControllerVprBuiltInPeerDemoConfig {
  bool enabled = false;
  float distanceMeters = 0.75f;
  float amplitude = 1024.0f;
  uint8_t channels[4] = {0U, 12U, 24U, 36U};
  uint8_t channelCount = 4U;
};

struct BleCsControllerVprHostConfig {
  BleCsControllerSessionConfig session{};
  ::Stream* peerResultStream = nullptr;
  uint8_t maxCommandsPerPump = 1U;
  size_t maxControllerBytesPerPoll = 128U;
  size_t maxPeerBytesPerPoll = 128U;
  BleCsControllerVprBuiltInPeerDemoConfig builtInPeerDemo{};
};

struct BleCsControllerVprWorkflowStartStatus {
  uint8_t readRemoteSupportedCapabilities = 0xFFU;
  uint8_t setDefaultSettings = 0xFFU;
  uint8_t createConfig = 0xFFU;
  uint8_t securityEnable = 0xFFU;
  uint8_t setProcedureParameters = 0xFFU;
  uint8_t procedureEnable = 0xFFU;
};

struct BleCsControllerVprSelectedStateExpectation {
  uint8_t selectedConfigId = 0U;
  uint8_t storedConfigCount = 0U;
  bool selectedRunnable = false;
};

struct BleCsControllerVprRetainedSelectionExpectation {
  uint8_t activeConfigId = 0U;
  uint8_t slot0ConfigId = 0U;
  uint8_t slot1ConfigId = 0U;
  uint8_t previousConfigId = 0U;
  uint8_t storedConfigCount = 0U;
  bool selectedRunnable = false;
  bool previousRunnable = false;
  uint8_t lastEvictedConfigId = 0U;
  bool checkLastEvictedConfigId = false;
};

struct BleCsControllerVprRetainedSlotsExpectation {
  uint8_t activeConfigId = 0U;
  uint8_t slot0ConfigId = 0U;
  uint8_t slot1ConfigId = 0U;
  uint8_t previousConfigId = 0U;
  uint8_t activePrimarySlotIndex = 0xFFU;
  uint8_t freePrimarySlotCount = 0U;
  uint8_t storedConfigCount = 0U;
};

struct BleCsControllerVprRetainedRunnabilityExpectation {
  bool selectedRunnable = false;
  bool slot0Runnable = false;
  bool slot1Runnable = false;
  bool previousRunnable = false;
};

struct BleCsControllerVprRetainedReadinessExpectation {
  bool selectedSecurityEnabled = false;
  bool slot0SecurityEnabled = false;
  bool slot1SecurityEnabled = false;
  bool previousSecurityEnabled = false;
  bool selectedProcedureParamsApplied = false;
  bool slot0ProcedureParamsApplied = false;
  bool slot1ProcedureParamsApplied = false;
  bool previousProcedureParamsApplied = false;
};

struct BleCsControllerVprRetainedStateExpectation {
  BleCsControllerVprRetainedSlotsExpectation slots{};
  BleCsControllerVprRetainedRunnabilityExpectation runnability{};
  BleCsControllerVprRetainedReadinessExpectation readiness{};
  uint8_t lastEvictedConfigId = 0U;
  bool checkRunnability = false;
  bool checkReadiness = false;
  bool checkLastEvictedConfigId = false;
};

struct BleCsControllerVprHostState {
  uint32_t heartbeat = 0U;
  uint16_t lastOpcode = 0U;
  uint32_t transportStatus = 0U;
  uint32_t lastError = 0U;
  bool running = false;
  bool secureAccessEnabled = false;
  bool linkSessionOpen = false;
  uint16_t linkConnHandle = 0U;
  uint8_t linkProcedureIntervalSelector = 0U;
  uint8_t linkStoredConfigCount = 0U;
  uint8_t linkPeerGapTicks = 0U;
  uint8_t linkResultPublishReason = 0U;
  uint8_t linkResultPendingStage = 0U;
  uint8_t linkResultPublishedStage = 0U;
  uint8_t linkLastEvictedConfigId = 0U;
  uint8_t linkConfigId = 0U;
  uint8_t linkSlot0ConfigId = 0U;
  uint8_t linkSlot1ConfigId = 0U;
  uint8_t linkPreviousConfigId = 0U;
  uint8_t linkAuthority0ConfigId = 0U;
  uint8_t linkAuthority1ConfigId = 0U;
  uint8_t linkAuthority2ConfigId = 0U;
  uint8_t linkActivePrimarySlotIndex = 0xFFU;
  uint8_t linkFreePrimarySlotCount = 0U;
  uint16_t linkProcedureCounter = 0U;
  bool linkConfigCreated = false;
  bool linkSecurityEnabled = false;
  bool linkProcedureParamsApplied = false;
  bool linkProcedureEnabled = false;
  bool linkMeasurementExecuteResultActive = false;
  bool linkSlot0InUse = false;
  bool linkSlot1InUse = false;
  bool linkPreviousSlotInUse = false;
  bool linkActiveConfigMirroredInPrevious = false;
  bool linkSelectedConfigRunnable = false;
  bool linkSlot0Runnable = false;
  bool linkSlot1Runnable = false;
  bool linkPreviousSlotRunnable = false;
  bool linkSelectedConfigSecurityEnabled = false;
  bool linkSlot0SecurityEnabled = false;
  bool linkSlot1SecurityEnabled = false;
  bool linkPreviousSlotSecurityEnabled = false;
  bool linkSelectedConfigProcedureParamsApplied = false;
  bool linkSlot0ProcedureParamsApplied = false;
  bool linkSlot1ProcedureParamsApplied = false;
  bool linkPreviousSlotProcedureParamsApplied = false;
  BleCsVprSchedulerState scheduler{};
  BleCsVprMeasurementWorkItem measurementWork{};
  BleCsVprMeasurementExecutionResult measurementExecution{};

  bool retainedConfigMatchesSlots(uint8_t activeConfigId,
                                  uint8_t slot0ConfigId,
                                  uint8_t slot1ConfigId,
                                  uint8_t previousConfigId,
                                  uint8_t activePrimarySlotIndex,
                                  uint8_t freePrimarySlotCount,
                                  uint8_t storedConfigCount) const {
    return linkConfigId == activeConfigId &&
           linkSlot0ConfigId == slot0ConfigId &&
           linkSlot1ConfigId == slot1ConfigId &&
           linkPreviousConfigId == previousConfigId &&
           linkSlot0InUse == (slot0ConfigId != 0U) &&
           linkSlot1InUse == (slot1ConfigId != 0U) &&
           linkPreviousSlotInUse == (previousConfigId != 0U) &&
           linkActivePrimarySlotIndex == activePrimarySlotIndex &&
           linkFreePrimarySlotCount == freePrimarySlotCount &&
           linkStoredConfigCount == storedConfigCount;
  }

  bool retainedConfigMatchesRunnability(bool selectedRunnable,
                                        bool slot0Runnable,
                                        bool slot1Runnable,
                                        bool previousRunnable) const {
    return linkSelectedConfigRunnable == selectedRunnable &&
           linkSlot0Runnable == slot0Runnable &&
           linkSlot1Runnable == slot1Runnable &&
           linkPreviousSlotRunnable == previousRunnable;
  }

