lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/ble_channel_sounding.h
 private:
  bool currentConnHandle(uint16_t* outConnHandle) const;
  bool buildConnectedMode2ResultHeader(uint8_t fallbackConfigId,
                                       uint8_t numAntennaPaths,
                                       BleCsSubeventResultHeader* outHeader) const;
  bool sendDirectBuiltCommand(const BleCsHciCommand& command, uint8_t* outStatus);
  bool consumeDirectAuxiliaryEvent(const uint8_t* packet, size_t packetLen);
  bool consumeTestResultEvent(uint8_t subeventCode,
                              const uint8_t* payload, size_t payloadLen);
  bool queuePendingInitiatorLlControlPduIfNeeded(
      BleRadio& radio,
      BleCsLlControlBridgeServiceResult* result);
  bool initiatorLlBridgeOwnsCurrentWorkflowPhase() const;
  bool llControlBridgeCachedNoTxStage(BleCsLlControlBridgeServiceResult* result);
  void resetLlControlBridgeQueueState();
  bool drainDirectControllerEvents(VprControllerServiceHost* directHost,
                                   const uint8_t* response,
                                   size_t responseLen,
                                   bool waitForBackgroundResults,
                                   bool requireConnectedCsResult);
  void syncVprState();

  BleCsControllerVprHostConfig config_;
  BleCsControllerVprHostState vprState_;
  BleCsControllerVprDrainStats lastDrainStats_;
  VprSharedTransportStream transport_;
  BleCsControllerStreamHost host_;
  BleCsFaeTable lastRemoteFaeTable_;
  BleCsTestEndComplete lastTestEndComplete_;
  bool lastTestEndCompleteValid_;
  /* Cached remote capabilities populated when consumeDirectAuxiliaryEvent
   * receives ReadRemoteSupportedCapabilitiesComplete / V2 events. */
  BleCsControllerCapabilities cachedRemoteCapabilitiesV1_;
  BleCsControllerCapabilities cachedRemoteCapabilitiesV2_;
  bool cachedRemoteCapabilitiesV1Valid_;
  bool cachedRemoteCapabilitiesV2Valid_;
  BleCsSubeventResultReassembler testReassembler_;
  BleCsSubeventResult lastTestResult_;
  bool lastTestResultValid_;
  uint16_t testResultCount_;
  bool llControlBridgeQueuedStageValid_;
  uint8_t llControlBridgeQueuedStage_;
  bool llControlBridgeNoTxStageValid_;
  uint8_t llControlBridgeNoTxStage_;
  uint8_t llControlBridgeNoTxPollSkips_;
};

}  // namespace xiao_nrf54l15
